<?xml version="1.0" ?><policyDefinitionResources revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions"><!--microsoft_edge version: 115.0.1901.188--><displayName/><description/><resources><stringTable><string id="WebView2LoaderOverrideSettings_group">Yükleyici Geçersiz Kılma Ayarları</string><string id="BrowserExecutableFolder">Tarayıcı yürütülebilir klasörünün konumunu yapılandırın</string><string id="BrowserExecutableFolder_Explain">Bu ilke WebView2 uygulamalarını belirtilen yolda WebView2 Çalışma Zamanı'nı kullanacak şekilde yapılandırır. Klasör şu dosyaları içermelidir: msedgewebview2.exe, msedge.dll vb.

Klasör yolunun değerini ayarlamak için bir Değer adı ve Değer çifti sağlayın. Değer adı olarak Uygulama Kullanıcı Modeli Kimliği'ni veya yürütülebilir dosya adını ayarlayın. Tüm uygulamalara uygulamak için değer adı olarak &quot;*&quot; joker karakterini kullanabilirsiniz.

Örnek değer:

Name: *, Value: C:\Program Files\Microsoft Edge WebView2 Runtime Redistributable 85.0.541.0 x64</string><string id="BrowserExecutableFolderDesc">Tarayıcı yürütülebilir klasörünün konumunu yapılandırın</string><string id="ReleaseChannelPreference">Sürüm kanalı arama sırası tercihini ayarlama</string><string id="ReleaseChannelPreference_Explain">Varsayılan kanal arama sırası WebView2 Runtime, Beta, Dev ve Canary'dir.

Varsayılan arama sırasını tersine çevirmek için bu ilkeyi 1 olarak ayarlayın.

Sürüm kanalı tercihinin değerini ayarlamak için bir Değer adı ve Değer çifti sağlayın. Değer adı olarak Uygulama Kullanıcı Modeli Kimliği'ni veya yürütülebilir dosya adını ayarlayın. Tüm uygulamalara uygulamak için değer adı olarak &quot;*&quot; joker karakterini kullanabilirsiniz.

Örnek değer:

Name: *, Value: 1</string><string id="ReleaseChannelPreferenceDesc">Sürüm kanalı arama sırası tercihini ayarlama</string><string id="ExperimentationAndConfigurationServiceControl">Deneme ve Yapılandırma Hizmeti ile iletişimi kontrol et</string><string id="ExperimentationAndConfigurationServiceControl_Explain">Deneme ve Yapılandırma Hizmeti, istemciye Deneme ve Yapılandırma yüklerini dağıtmak için kullanılır.

Deneme yükü, Microsoft'un test etme ve geri bildirim için etkinleştirdiği erken geliştirme aşamasındaki özelliklerin bir listesinden oluşur.

Yapılandırma yükü, Microsoft'un kullanıcı deneyimini optimize etmek için dağıtmak istediği önerilen ayarların bir listesinden oluşur.

 Yapılandırma yükü ayrıca, uyumluluk nedeniyle belirli etki alanlarında gerçekleştirilecek eylemlerin bir listesini de içerebilir. Örneğin, yeni Kullanıcı Aracısı dizesi nedeniyle bu web sitesi bozulursa tarayıcı bir web sitesindeki Kullanıcı Aracısı dizesini geçersiz kılabilir. Microsoft site sahibi ile sorunu çözmeye çalışırken bu eylemlerin her birinin geçici olması amaçlanmıştır.

      Bu ilkeyi 'FullMode' olarak ayarlarsanız tam yük, Deneme ve Yapılandırma Hizmeti'nden indirilir. Buna hem deneme hem de yapılandırma yükleri dahildir.

Bu ilkeyi 'ConfigurationsOnlyMode' olarak ayarlarsanız, yalnızca yapılandırma yükü indirilir.

Bu ilkeyi 'RestrictedMode' olarak ayarlarsanız, Deneme ve Yapılandırma Hizmeti ile iletişim tamamen durdurulur. Microsoft bu ayarı önermez.

Bu ilkeyi yönetilen bir cihazda yapılandırmazsanız, Beta ve Kararlı kanallarındaki davranış 'ConfigurationsOnlyMode' ile aynı olur. Canary ve Geliştirme kanallarında davranış 'FullMode' ile aynı olur.

 Bu ilkeyi yönetilmeyen bir cihazda yapılandırmazsanız, davranış 'FullMode' ile aynı olur.

İlke seçenekleri eşleme:

* FullMode (2) = Yapılandırmaları ve denemeleri al

* ConfigurationsOnlyMode (1) = Yalnızca yapılandırmaları al

* RestrictedMode (0) = Deneme ve Yapılandırma Hizmeti ile iletişimi devre dışı bırak

Bu ilkeyi yapılandırırken önceki bilgileri kullanın.</string><string id="ExperimentationAndConfigurationServiceControl_FullMode">Yapılandırmaları ve denemeleri al</string><string id="ExperimentationAndConfigurationServiceControl_ConfigurationsOnlyMode">Yalnızca yapılandırmaları al</string><string id="ExperimentationAndConfigurationServiceControl_RestrictedMode">Deneme ve Yapılandırma Hizmeti ile iletişimi devre dışı bırak</string><string id="SUPPORTED_WIN7_V97">Microsoft Edge sürüm 97, Windows 7 veya üstü</string><string id="SUPPORTED_WIN7_V87">Microsoft Edge sürüm 87, Windows 7 veya üstü</string><string id="microsoft_edge_webview2">Microsoft Edge WebView2</string><string id="microsoft_edge_webview2_recommended">Microsoft Edge WebView2 - Varsayılan Ayarlar (kullanıcılar geçersiz kılabilir)</string></stringTable><presentationTable><presentation id="BrowserExecutableFolder"><listBox refId="BrowserExecutableFolderDesc">Değer adını Uygulama Kullanıcı Modeli Kimliği veya yürütülebilir dosya adı olarak ayarlayın. Tüm uygulamalara uygulanacak değer adı olarak &quot;*&quot; joker karakterini kullanabilirsiniz.</listBox></presentation><presentation id="ReleaseChannelPreference"><listBox refId="ReleaseChannelPreferenceDesc">Değer adını Uygulama Kullanıcı Modeli Kimliği veya yürütülebilir dosya adı olarak ayarlayın. Tüm uygulamalara uygulanacak değer adı olarak &quot;*&quot; joker karakterini kullanabilirsiniz.</listBox></presentation><presentation id="ExperimentationAndConfigurationServiceControl"><dropdownList refId="ExperimentationAndConfigurationServiceControl">Deneme ve Yapılandırma Hizmeti ile iletişimi kontrol et</dropdownList></presentation></presentationTable></resources></policyDefinitionResources>